# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Daniel\Documents\PSoC Creator\ECE3091 Faster V3.6\Display.cydsn\Display.cyprj
# Date: Tue, 18 Oct 2016 21:06:04 GMT
#set_units -time ns
create_clock -name {Camera_CLK(routed)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {SW_Quad_Clock(routed)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 13.888888888888888 -waveform {0 6.94444444444444} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {timer_clock_sense} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {timer_clock_sense(fixed-function)} -period 27.777777777777775 -waveform {0 13.8888888888889} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {Camera_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 15} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_clock -name {timer_clock(fixed-function)} -period 97.222222222222214 -waveform {0 13.8888888888889} [get_pins {ClockBlock/dclk_glb_ff_2}]
create_generated_clock -name {LCD_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 9 17} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {SW_Quad_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 73 145} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 721 1441} [list [get_pins {ClockBlock/dclk_glb_5}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Daniel\Documents\PSoC Creator\ECE3091 Faster V3.6\Display.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Daniel\Documents\PSoC Creator\ECE3091 Faster V3.6\Display.cydsn\Display.cyprj
# Date: Tue, 18 Oct 2016 21:05:36 GMT
