# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Tim\Documents\GitHub\pucktacular\ECE3091TestSoftware\Display.cydsn\Display.cyprj
# Date: Wed, 31 Aug 2016 13:49:36 GMT
#set_units -time ns
create_clock -name {Camera_CLK(routed)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.888888888888888 -waveform {0 6.94444444444444} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 13.888888888888888 -waveform {0 6.94444444444444} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {Camera_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {LCD_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 21} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4801 9601} -nominal_period 66666.666666666657 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5625 11251} [list [get_pins {ClockBlock/dclk_glb_3}]]


# Component constraints for C:\Users\Tim\Documents\GitHub\pucktacular\ECE3091TestSoftware\Display.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Tim\Documents\GitHub\pucktacular\ECE3091TestSoftware\Display.cydsn\Display.cyprj
# Date: Wed, 31 Aug 2016 13:49:17 GMT
